{
    "WBUI2": {
        "settings": {
            "OpenButton": 0,
            "HideIcon": false,
            "HideIconAfter": 60,
            "IconURL": "https://imgur.com/aBDZE1Q.png",
            "DisableIconText": true,
            "IconPosition": 0,
            "IconTextColor": 0,
            "OpenOnStart": true,
            "OpenOnStartOnlyNewPlayers": false,
            "UpdateInterval": 12
        },
        "tabs": [
            {
                "tab1": {
                    "layout": 3,
                    "buttontext": "Welcome",
                    "title1": "Welcome to Twisted Whiskers Cluster",
                    "title2": "Online Players",
                    "title3": "Newest Server Features",
                    "text1": "<TextStyle.Red>*****ATTENTION SURVIVORS*****</>\n\nWelcome to the Twisted Whiskers Cluster — a realm where adventure, strategy, and survival intertwine. Here, every corner of the world holds secrets, danger, and opportunity. From your first step on the sunlit plains to your descent into the shadowy depths of the unknown, the cluster is designed to challenge your cunning, your resilience, and your sense of community.\n\n<TextStyle.Orange>Within this hub, you will find guidance on server operations, mods, rates, and community rules. Take time to explore each tab to understand the unique systems we’ve created to support both new and veteran survivors. Engage with our discord, participate in events, and make your mark on the Twisted Whiskers legacy.</>\n\n<TextStyle.Green>Current Online Players:</>\n{text2}\n\n<TextStyle.Violet>Newest Server Features:</>\n\n<TextStyle.White>Twisted Whiskers: Valguero</>\nStep into a vast new world of rugged mountains, dense forests, and hidden caverns teeming with life and danger. Explore the underground ocean and uncover the secrets of The Abyss. Each expedition offers the thrill of discovery and the chance to carve out your territory amidst dynamic ecosystems. Valguero emphasizes balanced PvE survival with immersive exploration and discovery.\n\n<TextStyle.White>Twisted Whiskers: ASArik (PvE Expansion)</>\nEnter the experimental frontier of the cluster: ASArik. Custom mods, evolving events, and unique dino variants create a living, breathing environment. ASArik rewards strategic thinking, collaboration, and exploration, offering veterans new challenges while maintaining harmony with the original Twisted Whiskers PvE world.\n\n<TextStyle.White>Twisted Purrgatory (PvP, Separate)</>\nFor those seeking the ultimate test of skill and cunning, Twisted Purrgatory delivers a feral PvP environment where every encounter carries high stakes. The economy, events, and progression here exist independently from the PvE cluster, allowing PvP enthusiasts to engage without impacting the balance of Twisted Whiskers PvE.\n\n<TextStyle.Green>Remember:</> The pride thrives when each survivor respects the rules, embraces exploration, and contributes to the evolving saga of the cluster.",
                    "text2": "{playerlist}",
                    "text3": "Discover your potential, survive the wilds, and write your story in the annals of Twisted Whiskers.",
                    "imageurl": "https://github.com/TwistedBobRoss/TwistedKittens/blob/main/tkglogo3.png?raw=true"
                }
            },
            {
                "tab2": {
                    "layout": 3,
                    "buttontext": "Cluster Rules",
                    "title1": "Territory & Tribal Claims",
                    "title2": "Building & Code of the Wild",
                    "title3": "Disciplinary Path",
                    "text1": "<TextStyle.Orange>Territory & Tribal Claims</>\nEach tribe may claim two bases per map, each sized to maintain fair play and performance. Solo survivors may claim one per map. Joining a tribe requires merging your base into the tribe’s stronghold. Over-claiming results in admin action.\n\n<TextStyle.Orange>Building With Balance</>\nBuild your sanctuary, but keep it clean, performance-friendly, and fair. Mega bases require admin approval. Never block high-resource zones, explorer notes, or artifact terminals. If unsure, always ask before building.\n\n<TextStyle.Orange>Code of the Wild</>\nNo offline breeding. No egg theft. Harassment is prohibited. Trust is earned — admins do not intervene in tribal drama.",
                    "text2": "<TextStyle.Red>The Harsh Truth</>\nLost tames and resources are part of Ark. Admins do not replace losses. Support requests are handled in the order received as time allows.\n\nAbandoned creatures at other bases or obelisks will be wiped without warning.\n\n<TextStyle.Red>Flag System Rules</>\nNormal Players: Update flags monthly; failure results in tribe wipes.\nSubscribed Players: Update every 3 months; non-compliance follows normal schedule if subscription ends.\nAdmins: Must also follow the 3-month rule. Wipes occur on failures.\nViolations result in full tribe wipes, with salvaged items and tames possibly auctioned.\nAdmin-chosen flag colors must be respected without exception.",
                    "text3": "<TextStyle.Violet>Disciplinary Path (Rule of Three)</>\nFirst Offense: Verbal warning + 24hr notice in Discord.\nSecond Offense: Structures, tames, or players may be wiped.\nThird Offense (30 days): Permanent banishment.\n\nHonor the pride: report rule-breakers. Supporters are rewarded generously.",
                    "imageurl": "https://github.com/TwistedBobRoss/TwistedKittens/blob/main/tkglogo3.png?raw=true"
                }
            },
            {
                "tab3": {
                    "layout": 3,
                    "buttontext": "Rates & Mods",
                    "title1": "Current Rates",
                    "title2": "Mod List",
                    "title3": "Server Notes",
                    "text1": "<RichColor Color=\"1,0,0,1\">*****CURRENT RATES*****</>\n\nXP 1.5x | Alpha Kill XP 1.33x | Boss XP 2.5x | Wild Kill XP 1.25x | Crafting XP 1.25x\nTaming Speed 5x\nHarvest 2.5x\nPlayer Water/Food Drain 0.75x\nHealth Recovery 2.5x\nDecay Timer 3.5x\nPlayer Damage 1.25x | Player Resistance 1.25x | Structure Resistance 0x\n24 hours in-game = 120 min IRL",
                    "text2": "For a complete list of mods and updates, visit:\nwww.twistedkittensgaming.com\nJoin the Discord for real-time news: dsc.gg/twistedwhiskers",
                    "text3": "Restart Schedule: 3AM EST daily.\nConnect Discord and player accounts to use the shop and receive token bonuses.",
                    "imageurl": "https://github.com/TwistedBobRoss/TwistedKittens/blob/main/tkglogo3.png?raw=true"
                }
            },
            {
                "tab4": {
                    "layout": 3,
                    "buttontext": "Events & Tips",
                    "title1": "Upcoming Events",
                    "title2": "Tips & Tricks",
                    "title3": "Quests",
                    "text1": "<TextStyle.Orange>Fun & Rewards</>\nWords of the Month: Guess correctly for free tokens. Starter lotto: chance to win 1000 tokens, higher tiers coming soon.",
                    "text2": "<TextStyle.Violet>Performance Tips</>\nFollow the guide to improve console and lower-end PC performance:\nhttps://twistedkittensgaming.premiumark.net/news/92130-commands-to-help-console-and-lower-speedperformance-pcs",
                    "text3": "<TextStyle.Red>Active Quest & Hidden Treasures</>\nSearch Bob beaches for hidden prizes, including tames, building materials, and WebToken consumables. 5 locations per map, maintained monthly.",
                    "imageurl": "https://github.com/TwistedBobRoss/TwistedKittens/blob/main/tkglogo3.png?raw=true"
                }
            },
            {
                "tab5": {
                    "layout": 3,
                    "buttontext": "Shop Info",
                    "title1": "Current Verified Shops",
                    "title2": "Shop Guidelines",
                    "title3": "Admin Shop",
                    "text1": "This directory lists all player shops registered with Twisted Kittens Gaming. Verified shops adhere to strict rules to protect consumers and maintain fairness.\n\nRules include: mandatory saddles with tames, prohibition on selling spayed/neutered creatures, and full-stack sales for resources.",
                    "text2": "Report violations through GSA radial menu, Discord, or the website. Include date, transaction/violation type, shop name/location, and survivor names involved. Admins will investigate promptly.",
                    "text3": "Visit the Admin Shop for unique items, consumables, and starter kits:\nhttps://twistedkittensgaming.premiumark.net/shop",
                    "imageurl": "https://github.com/TwistedBobRoss/TwistedKittens/blob/main/tkglogo3.png?raw=true"
                }
            }
        ],
        "links": [
            {
                "link1": {
                    "text": "TikTok",
                    "url": "https://www.tiktok.com/@twistedkittensgaming"
                }
            },
            {
                "link2": {
                    "text": "Discord",
                    "url": "dsc.gg/twistedwhiskers"
                }
            },
            {
                "link3": {
                    "text": "AdminShop",
                    "url": "https://twistedkittensgaming.premiumark.net/shop"
                }
            },
            {
                "link4": {
                    "text": "Facebook",
                    "url": "https://www.facebook.com/TwistedKittensGaming"
                }
            },
            {
                "link5": {
                    "text": "Twitch",
                    "url": "https://www.twitch.tv/twistedbobross"
                }
            },
            {
                "link6": {
                    "text": "Kick",
                    "url": "https://kick.com/twistedkittensgaming"
                }
            }
        ]
    }
}
